def task1():
    """
    Прочитайте два цілих числа від юзера (STDIN) і надрукуйте три рядки, де:
а) Перший рядок містить суму двох чисел.
б) Другий рядок містить різницю двох чисел (перше число - друге).
в) Третій рядок містить продукт двох цифр.
 
    """
    n1 = int(input('Введіть перше ціле число\n'))
    n2 = int(input('Введіть друге ціле число\n'))
    print('Відповідь:\n', n1 + n2, '\n', n1 - n2, '\n', n1 * n2)


def task2():
    """
    Задано ціле число n ( input  від користувача ), виконайте наступні умовні дії:
    a) якщо число непарне,  надрукуйте  "weird"
    б) якщо число парне і є в діапазоні від 2 до 5 надрукуйте “not weird”
    в) якщо число парне і є в діапазоні від 6 до 20 надрукуйте “weird”
    г) якщо число більше 20 надрукуйте “not weird”

    """

    n = int(input("Введіть ціле число\n"))
    if n > 20:
        print("not weird")
    elif n % 2 == 1:
        print("weird")
    elif n % 2 == 0 & 2 <= n <= 5:
        print("not weird")
    elif n % 2 == 0 & 6 <= n <= 20:
        print("weird")


def is_leap(b):
    """
     Ми додаємо "високосний день" майже кожні чотири роки ( 29 лютого ).
У григоріанському календарі необхідно враховувати три критерії, щоб визначити високосні роки:
    а) рік можна без залишку розділити на 4, це високосний рік
    б) але якщо рік можна без залишку розділити на 100, це НЕ високосний рік
    в) але якщо рік також без залишку ділиться на 400. Тоді це високосний рік.
Написати функцію is_leap  яка приймає 1 агрумент - рік. І вертає True або False

    """
    year = int(input("Введіть рік\n"))
    if year % 4 == 0 & year % 100 == 0 & year % 400 == 0:
        b = bool(True)
    elif year % 4 == 0 & year % 100 == 0 & year % 400 != 0:
        b = bool(False)
    elif year % 4 == 0:
        b = bool(True)
    else:
        b = bool(False)

    return bool(b)


if __name__ == "__main__":
    # task2()
    b = 0
    print(is_leap(b))
